src/main/resources/requestExample.xml

<!--curl &#45;&#45;header "content-type: text/xml" -d @request9.xml http://localhost:8080/ws^C-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://response.dto.khryniewicki.com.pl">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCurrencyRequest>
            <gs:Currency>euro</gs:Currency>
            <gs:StartingDate>2020-02-12</gs:StartingDate>
            <gs:EndingDate>2020-04-10</gs:EndingDate>
        </gs:getCurrencyRequest>
    </soapenv:Body>
</soapenv:Envelope>
